Revit 2016 API
LoadUsageArray.ForwardIterator Method
Retrieve a forward moving iterator to the array.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
Syntax
C#
public virtual LoadUsageArrayIterator ForwardIterator()
Visual Basic
Public Overridable Function ForwardIterator As LoadUsageArrayIterator
Visual C++
public:
virtual LoadUsageArrayIterator^ ForwardIterator()
Return Value
Returns a forward moving iterator to the array.
See Also
LoadUsageArray Class
Autodesk.Revit.DB.Structure Namespace